{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "2"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "2"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "2"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_weight", 
      "attrs": {"num_hidden": "362"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_bias", 
      "attrs": {"num_hidden": "362"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected0", 
      "attrs": {"num_hidden": "362"}, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "move_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "1"
      }, 
      "inputs": [[9, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 1], [30, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_weight", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_bias", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected1", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_weight", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_bias", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected2", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "value_label", 
      "inputs": []
    }, 
    {
      "op": "LinearRegressionOutput", 
      "name": "linearregressionoutput0", 
      "inputs": [[40, 0, 0], [41, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    19, 
    20, 
    22, 
    24, 
    25, 
    27, 
    28, 
    29, 
    30, 
    33, 
    34, 
    37, 
    38, 
    41
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49
  ], 
  "heads": [[23, 0, 0], [42, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10200]}
}