{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attr": {
        "kernel": "(4, 4)", 
        "num_filter": "20", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attr": {
        "kernel": "(4, 4)", 
        "num_filter": "20", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attr": {
        "kernel": "(4, 4)", 
        "num_filter": "20", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attr": {
        "kernel": "(4, 4)", 
        "num_filter": "50", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attr": {
        "kernel": "(4, 4)", 
        "num_filter": "50", 
        "pad": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attr": {
        "kernel": "(4, 4)", 
        "num_filter": "50", 
        "pad": "(1, 1)"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attr": {
        "kernel": "(4, 4)", 
        "num_filter": "70"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attr": {
        "kernel": "(4, 4)", 
        "num_filter": "70"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attr": {
        "kernel": "(4, 4)", 
        "num_filter": "70"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_weight", 
      "attr": {"num_hidden": "500"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_bias", 
      "attr": {"num_hidden": "500"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected0", 
      "attr": {"num_hidden": "500"}, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_weight", 
      "attr": {"num_hidden": "361"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_bias", 
      "attr": {"num_hidden": "361"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected1", 
      "attr": {"num_hidden": "361"}, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[23, 0, 0], [24, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    6, 
    7, 
    11, 
    12, 
    17, 
    18, 
    21, 
    22, 
    24
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26
  ], 
  "heads": [[25, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 1100]}
}